{
  "links": {
    "ui:disabled": true
  },
  "Title": {
    "ui:help": "The title of your data package"
  },
  "Description": {
    "ui:help": "A description of your data package",
    "ui:widget": "textarea"
  },
  "Additional_Documentation": {
    "ui:widget": "textarea"
  },
  "Discipline": {
    "items": {
      "ui:help": "A part of a domain distinguished from adjacent parts by a distinctive feature or characteristic."
    }
  },
  "Lab": {
    "items": {
      "ui:help": "Facility that provides controlled conditions in which scientific or technological research, experiments, and measurements has been performed. The laboratory is mentioned in the pre-defined vocabulary of laboratories."
    }
  },
  "Additional_Lab": {
    "items": {
      "ui:help": "facility that provides controlled conditions in which scientific or technological research, experiments, and measurements has been performed. This laboratory has a minor role compared to the originating laboratory or is not mentioned in the pre-defined vocabulary of laboratories."
    }
  },
  "Version": {
    "ui:help": "A version number for the data package"
  },
  "Language": {
    "ui:help": "The language of the data package"
  },
  "Collected": {
    "ui:help": "Indicate when collecting the data for this data package started and ended",
    "Start_Date": {
      "ui:help": "Indicate when you've started collecting the data for this data package"
    },
    "End_Date": {
      "ui:help": "Indicate when you've finished collecting the data for this data package"
    }
  },
  "GeoLocation": {
    "items": {
      "geoLocationBox": {
        "ui:field": "geo"
      }
    }
  },
  "Main_Setting": {
    "items": {
      "ui:help": "The geologic, hydrologic, and geochemical systems of the region in which a geologic repository operations area is or may be located."
    }
  },
  "Process_Hazard": {
    "items": {
      "ui:help": "A natural process whereby geological features are modified. Geologic processes become geologic hazards when they pose a threat to human life and/or property or in threatening populations of species."
    }
  },
  "Geological_Structure": {
    "items": {
      "ui:help": "The result of the powerful tectonic forces that occur within the earth. These forces fold and break rocks, form deep faults, and build mountains. Repeated applications of force—the folding of already folded rocks or the faulting and offsetting of already faulted rocks—can create a very complex geologic picture that is difficult to interpret. Most of these forces are related to plate tectonic activity. Some of the natural resources we depend on, such as metallic ores and petroleum, often form along or near geologic structures. Thus, understanding the origin of these structures is critical to discovering more reserves of our nonrenewable resources."
    }
  },
  "Geomorphical_Feature": {
    "items": {
      "ui:help": "Topographic and bathymetric landforms on the Earth's surface."
    }
  },

  "Material": {
    "items": {
      "ui:help": "Naturally occurring matter derived from or consisting of rock and sediment."
    }
  },

  "Apparatus": {
    "items": {
      "ui:help": "Any instrument or apparatus which, by reason of its objective technical characteristics and the results which it makes it possible to obtain, is mainly or exclusively suited to scientific activities."
    }
  },

  "Monitoring": {
    "items": {
      "ui:help": "Display produced by a device that takes signals and displays them on a television screen or a computer monitor."
    }
  },

  "Software": {
    "items": {
      "ui:help": "The instructions that control what a computer does; computer programs"
    }
  },

  "Measured_Property": {
    "items": {
      "ui:help": "A property of a physical system which can be compared against a standard unit of measurement to provide a numerical value defining the quantity of that property."
    }
  },



  "Tag": {
    "items": {
      "ui:help": "Free text field for adding (searchable) key words to your data package"
    }
  },
  "Related_Datapackage": {
    "items": {
      "Relation_Type": {
        "ui:help": "Relation to this data package"
      },
      "Title": {
        "ui:help": "Title of the related work"
      },
      "Persistent_Identifier": {
        "ui:help": "Persistent identifier of the related work",
        "Identifier_Scheme": {
          "ui:help": "Type of Persistent identifier of the related work"
        },
        "Identifier": {
          "ui:help": "The identifier as it can be resolved on the appropriate service"
        }
      }
    }
  },
  "Funding_Reference": {
    "items": {
      "Funder_Name": {
        "ui:help": "The name(s) of the organisation(s) funding the research. E.g. NWO"
      },
      "Award_Number": {
        "ui:help": "The award or grant number issued by the funding organisation"
      }
    }
  },
  "Retention_Period": {
    "ui:help": "The minimal number of years the data will be kept in the archive",
    "ui:widget": "updown"
  },
  "Retention_Information": {
    "ui:help": "Provide the reason when you deviate from the minimum of 10 years retention of the data package"
  },
  "Data_Type": {
    "ui:help": "What is the type of your data"
  },
  "Data_Classification": {
    "ui:help": "How is your data classified with regards to information security policy"
  },
  "Embargo_End_Date": {
    "ui:help": "If there is an embargo on the data package; when will it end?"
  },
  "Creator": {
    "items": {
      "Name": {
        "ui:help": "The name of the person(s) who created (a version of) the data package.",
        "Given_Name": {
          "ui:help": "The personal or first name of the person(s) who created (a version of) the data package"
        },
        "Family_Name": {
          "ui:help": "The surname or last name of the person(s) who created (a version of) the data package"
        }
      },
      "Affiliation": {
        "items": {
          "ui:help": "The organizational or institutional affiliation of the creator"
        }
      },
      "Person_Identifier": {
        "items": {
          "ui:help": "Person identifier of creator of the data package",
          "Name_Identifier_Scheme": {
            "ui:help": "What type of person identifier is used? (e.g. an ORCID, DAI, or ScopusID)"
          },
          "Name_Identifier": {
            "ui:help": "Identifier as it can be resolved on the appropriate service"
          }
        }
      }
    }
  },
  "Contributor": {
    "items": {
      "Name": {
        "ui:help": "The name(s) of the persons who have contributed to this data package",
        "Given_Name": {
          "ui:help": "The personal or first name of the person(s) who has contributed to (a version of) the data package"
        },
        "Family_Name": {
          "ui:help": "The surname or last name of the person(s) who has contributed to (a version of) the data package"
        }
      },
      "Contributor_Type": {
        "ui:help": "The type of contributor. List of values is derived from DataCite"
      },
      "Affiliation": {
        "items": {
          "ui:help": "The organizational or institutional affiliation of the creator"
        }
      },
      "Person_Identifier": {
        "items": {
          "ui:help": "Person identifier of contributor to this data package",
          "Name_Identifier_Scheme": {
            "ui:help": "What type of person identifier is used? (e.g. an ORCID, DAI, or ScopusID)"
          },
          "Name_Identifier": {
            "ui:help": "Identifier as it can be resolved on the appropriate service"
          }
        }
      }
    }
  },
  "License": {
    "ui:help": "The license under which you offer the data package for use by third parties. Preferred value is CC BY"
  },
  "Data_Access_Restriction": {
    "ui:help": "Once archived, how is your data package accessible to third parties?"
  }
}
